Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum
The analysis types.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_IGNORE
The ignore analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_TRUSS
The truss analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_RIGID_DIAPHRAGM
The rigid diaphragm analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_TENSION_ONLY
The tension only analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_COMPRESSION_ONLY
The compression only analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_SHELL
The shell analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_SHEAR_WALL
The wall analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_BEAM
The beam analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_MEMBRANE
The membrane analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_PLATE
The plate analysis type.

Tekla.Structures.Analysis.AnalysisPart.AnalysisTypeEnum.ANALYSIS_TYPE_MAT_FOUNDATION
The mat foundation analysis type.